Tekla Open API Reference for Tekla Structures 2025
DrawingCreator Methods
Methods
Name | Description
CreateDrawings(AutoDrawingRule, Identifier)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
CreateDrawings(AutoDrawingRule, List<Identifier>, AutoDrawingsStatusEnum)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
CreateDrawings(AutoDrawingRule, Identifier, AutoDrawingsStatusEnum)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
Top
See Also
Reference
DrawingCreator Class
Tekla.Structures.Drawing.Automation Namespace